% Гармонический анализ двойного 
% прямоугольного импульса 
%------------------------------------------------ 

% Вычисление коэффициентов 
% ряда Фурье при T1=2 
A  = -3;
T1 = 2; 
N  = 5;    % номер последнего члена ряда Фурье
t  = [-1:0.02:1];

%================================================ 

% Аппроксимация сигнала s(t) рядом Фурье
s1 = (1+A)/2;
for j=1:2:N
    b = 2*(A-1)/(j*pi);
    s1 = s1 + b*sin(j*2*pi/T1*t);
end

% Построение графика функции s1(t) 
plot(t, s1, 'k', 'LineWidth', 1.3) 
axis([-1 1 -4 2]) 
hL1 = line([-1 0], [1 1]); 
set(hL1, 'LineWidth', 2.4, 'LineStyle', '--', 'Color', 'b') 
hL2 = line([0 1], [A A]); 
set(hL2, 'LineWidth', 2.4, 'LineStyle', '--', 'Color', 'b') 
hold on 
%================================================ 
set(gca, 'GridLineStyle', '-')
grid on
