% Гармонический анализ двойного 
% прямоугольного импульса 
%------------------------------------------------ 
  % Вычисление коэффициентов 
  % ряда Фурье при T1=2 
A=-3; T1=2; 
%================================================ 
a0 = 1+A; 
b1 = 2*(A-1)/pi; 
b3 = 2*(A-1)/(3*pi); 
b5 = 2*(A-1)/(5*pi); 
% Аппроксимация сигнала s(t) рядом Фурье 
t = [-1:0.02:1]; 
s1 = a0/2 + b1*sin(2*pi/T1*t)+... 
     b3*sin(3*2*pi/T1*t) + b5*sin(5*2*pi/T1*t); 
% Построение графика функции s1(t) 
plot(t, s1, 'k', 'LineWidth', 1.3) 
axis([-1 1 -4 2]) 
hL1 = line([-1 0], [1 1]); 
set(hL1, 'LineWidth', 2.4, 'LineStyle', '--', 'Color', 'b') 
hL2 = line([0 1], [A A]); 
set(hL2, 'LineWidth', 2.4, 'LineStyle', '--', 'Color', 'b') 
hold on 
%================================================ 
set(gca, 'GridLineStyle', '-')
grid on
