% График функции g(t), представляющий собой свёртку f(t) и h(t)
t1 = [0:0.1:1];
g1 = t1.^2 / 2;
t2 = [1:0.1:2];
g2 = -t2.^2 + 3*t2 - 3/2;
t3 = [2:0.1:3];
g3 = t3.^2 / 2 - 3*t3 + 9/2;

% Конкатенация векторов-строк
t = [t1 t2 t3];
g = [g1 g2 g3];

plot(t, g, 'r-', 'LineWidth', 2.5)
grid on
hold on

%--------------------------------------------
x_mark = [1 2];
y_mark = [0.5 0.5];
plot(x_mark, y_mark, 'k.', 'Marker', 'o', 'MarkerSize', 5,...
    'MarkerFaceColor', 'k')
plot([1 1], [0 0.8], 'k--', 'LineWidth', 1.5)
plot([2 2], [0 0.8], 'k--', 'LineWidth', 1.5)
axis([0 3.5 0 0.8])