% Моделирование прохождения М-последовательности
% через согласованный фильтр
%-----------------------------------------------------
figure('Color', 'w');
clear all

% Входная ПСП
M = [1 1 1 1 -1 1 -1 1 1 -1 -1 1 -1 -1 -1];
N = length(M);
% Импульсный отклик СФ
h = [-1 -1 -1 1 -1 -1 1 1 -1 1 -1 1 1 1 1];

% Операция свёртки двух одномерных массивов
r = conv(M, h)/N;

plot(r, 'k', 'LineWidth', 3)
set(gca, 'GridLines', '-')
grid on
axis([0 30 -0.4 1.2])

%-----------------------------------------------------
% Горизонтальная ось
line([0 30], [0 0], 'LineWidth', 2, 'Color', 'k')