% Определение автокорреляционной функции
% кодовой последовательности Баркера длительности N
% и построение её графика
figure('Color', 'w')
clear all

M = [1 1 1 -1 -1 1 -1];
N = 7;

for m = 1:N
    s = 0;
    for n = (m+1):N
        s = s + M(n)*M(n-m);
    end
    R(m) = s;
end
y = R/N;
m1 = 0:N;
y1 = [1 y];
plot(m1, y1, 'k-', 'LineWidth', 2.3)
set(gca, 'GridLines', '-')
grid on
axis([0 N+1 -(1/N + 0.1) 1.1])
%------------------------------------------

% горизонтальная ось
line([0 N+1], [0, 0], 'LineWidth', 2, 'Color', 'k')