% М-последовательность с N=15 на входе СФ
% и выходное напряжение согласованного фильтра
figure('Color','w')
hold on
clear all

% Входная ПСП
M = [1 1 1 1 -1 1 -1 1 1 -1 -1 1 -1 -1 -1];
N = length(M);
% Импульсный отклик СФ - зеркальное отражение М-последовательности
h = fliplr(M);
% Операция свёртки двух одномерных массивов
r = conv(M, h)/N;
plot([-N:N], [0 r 0], 'b-', 'LineWidth', 2.5)

%-----------------------------------------------------
% Построение М-последовательности
t = -0.01:0.01:N+0.01;
y = zeros(1, length(t));
for i=1:N
    y = y + M(i)*rectpuls(t+0.5-i);
end

t1 = t-N;        % смещение графика ПСП по оси X
y1 = y*0.2+1.4;  % масштабирование и смещение графика ПСП по оси Y 
plot(t1, y1, 'r-', 'LineWidth', 3)
line([-16 3], [1.4 1.4], 'LineWidth', 2, 'Color', 'k');  % Ось
line([0 0], [1.2 -0.4], 'LineWidth', 1.8, 'Color', 'k');
%=====================================================

grid on
axis([-20 20 -0.4 1.7])
%----------------------------------------- 
% Горизонтальная ось
line([-15 17], [0 0], 'LineWidth', 2, 'Color', 'k');
% Вертикальная ось
line([-15 -15], [-0.4 1.4], 'LineWidth', 2, 'Color', 'k');
line([-15 15], [-0.2 -0.2], 'LineWidth', 1.5, ...
    'LineStyle', '--', 'Color', 'k');
set(gca, 'Box', 'off', 'XGrid', 'on', ...
    'GridLineStyle', '--', 'LineWidth', 3, 'Color', 'y')