% Взаимная корреляционная функция двух дискретных
% последовательностей u(t) и v(t)
%------------------------------------------------
clear all
clf
set(gcf, 'Color', 'w')

wal = [
    1  1  1  1   1  1  1  1   1  1  1  1   1  1  1  1
    1  1  1  1   1  1  1  1  -1 -1 -1 -1  -1 -1 -1 -1
    1  1  1  1  -1 -1 -1 -1  -1 -1 -1 -1   1  1  1  1
    1  1  1  1  -1 -1 -1 -1   1  1  1  1  -1 -1 -1 -1
    
    1  1 -1 -1  -1 -1  1  1   1  1 -1 -1  -1 -1  1  1
    1  1 -1 -1  -1 -1  1  1  -1 -1  1  1   1  1 -1 -1
    1  1 -1 -1   1  1 -1 -1  -1 -1  1  1  -1 -1  1  1
    1  1 -1 -1   1  1 -1 -1   1  1 -1 -1   1  1 -1 -1
    
    1 -1 -1  1   1 -1 -1  1   1 -1 -1  1   1 -1 -1  1
    1 -1 -1  1   1 -1 -1  1  -1  1  1 -1  -1  1  1 -1
    1 -1 -1  1  -1  1  1 -1  -1  1  1 -1   1 -1 -1  1
    1 -1 -1  1  -1  1  1 -1   1 -1 -1  1  -1  1  1 -1
    
    1 -1  1 -1  -1  1 -1  1   1 -1  1 -1  -1  1 -1  1
    1 -1  1 -1  -1  1 -1  1  -1  1 -1  1   1 -1  1 -1
    1 -1  1 -1   1 -1  1 -1  -1  1 -1  1  -1  1 -1  1
    1 -1  1 -1   1 -1  1 -1   1 -1  1 -1   1 -1  1 -1
];

% u = wal(12+1,:);
% v = wal(14+1,:);
u = [1 1 1 -1];
v = [1 1 -1 1];
N = length(u);
% v = [v zeros(1,N-length(v))];

Ruv = zeros(1,2*N+1);
for m = -N:N
	if m<0
		imin = 1;
		imax = N+m;
	else
		imin = m+1;
		imax = N;
	end;
	for i = imin:imax
		Ruv(m+N+1)= Ruv(m+N+1) + u(i)*v(i-m);
	end
end

plot(-N:N, Ruv/N, 'k-', 'LineWidth', 3)
set(gca, 'GridLineStyle', '-', 'XLim', [-N N])
grid on
%------------------------------------------------
% Горизонтальная ось
line([-N N], [0 0], 'LineWidth', 3, 'Color', 'k');
plot2svg('filename.svg',1)
