% Вычисление нормированной ВКФ прямоугольного импульса
% и треугольного Kuv(tau)
%---------------------------------------------------
figure('Color', 'w')
clear all

% x = tau/T,  tau < 0
x = [-1:0.01:0];
K = 0.5*(1-abs(x)).^2;
plot(x, K, 'k-', 'Linewidth', 3)
hold on

% x = tau/T,  tau > 0
x1 = [0:0.01:1];
K1 = 0.5*(1-x1.^2);
plot(x1, K1, 'k-', 'Linewidth', 3)

set(gca, 'GridLines', '-')
grid on
axis([-1.5 1.5 -0.2 0.7])
%---------------------------------------------------
% Горизонтальная ось
line([-1.5 2], [0 0], 'LineWidth', 2, 'Color', 'k')